## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # kubernetes_namespace.istio-system will be destroyed
  # (because kubernetes_namespace.istio-system is not in configuration)
-   resource "kubernetes_namespace" "istio-system" {
-       id = "istio-system" -> null

-       metadata {
-           annotations      = {} -> null
-           generation       = 0 -> null
-           labels           = {} -> null
-           name             = "istio-system" -> null
-           resource_version = "1893" -> null
-           uid              = "8b612f89-90ca-4066-9aeb-4e66f7eb4012" -> null
        }
    }

  # module.asm.kubernetes_config_map.asm_options will be created
+   resource "kubernetes_config_map" "asm_options" {
+       data = {
+           "ASM_OPTS"          = "CNI=on"
+           "multicluster_mode" = "manual"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "asm-options"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.kubernetes_namespace.system will be created
+   resource "kubernetes_namespace" "system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components_destroy[0] will be created
+   resource "null_resource" "additional_components_destroy" {
+       id       = (known after apply)
+       triggers = {
+           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.module_depends_on[0] will be created
+   resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "1"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] will be created
+   resource "null_resource" "run_command" {
+       id       = (known after apply)
+       triggers = {
+           "arguments"             = "77a2b10d38c550faf4633c35dc8107fd"
+           "create_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
+           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
+           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] will be created
+   resource "null_resource" "run_destroy_command" {
+       id       = (known after apply)
+       triggers = {
+           "destroy_cmd_body"       = "cinema us-central1 terrateam-362405 false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
+           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
+           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
